Autodesk.Revit.DB.Analysis.HVACLoadBuildingType.IsValidTime(System.String)
Check if the string can be parsed to a valid time for opening time and closing time. A valid string can be "16:30" or "4:30 PM";
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2018

Autodesk.Revit.DB.Analysis.HVACLoadBuildingType.IsNameUnique(System.String)
Determines whether a potential building type name is unique.
name:
The candidate name.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2018

Autodesk.Revit.DB.Analysis.HVACLoadBuildingType.IsNameUnique(Autodesk.Revit.DB.Document,System.String)
Determines whether a potential building type name is unique.
document:
The document.
name:
The candidate name.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2018

Autodesk.Revit.DB.Analysis.HVACLoadBuildingType.Create(Autodesk.Revit.DB.Document,System.String)
Creates a building type element.
document:
The document.
name:
The building type name.
Returns:
The new building type.
Throws Autodesk.Revit.Exceptions.ArgumentException:
name is an empty string or contains only whitespace.
-or-
name cannot include prohibited characters.
-or-
The given value for name is already in use as a building type name.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2018

Autodesk.Revit.DB.Analysis.HVACLoadBuildingType.UnoccupiedCoolingSetPoint
The unoccupied cooling set point of the building type with unit kelvin (K).
Throws Autodesk.Revit.Exceptions.ArgumentException:
When setting this property: The value should be between (273.15, 373.15] with unit kelvin (K).
Since:
2018

Autodesk.Revit.DB.Analysis.HVACLoadBuildingType.ClosingTime
The closing time of the building type.
Throws Autodesk.Revit.Exceptions.ArgumentException:
When setting this property: It is not a valid time, can be something like "16:30" or "4:30 PM".
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
When setting this property: A non-optional argument was NULL
Since:
2018

Autodesk.Revit.DB.Analysis.HVACLoadBuildingType.OpeningTime
The opening time of the building type.
Throws Autodesk.Revit.Exceptions.ArgumentException:
When setting this property: It is not a valid time, can be something like "16:30" or "4:30 PM".
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
When setting this property: A non-optional argument was NULL
Since:
2018

Autodesk.Revit.DB.Analysis.HVACLoadBuildingType.BuildingTypeName
The building type name.
Throws Autodesk.Revit.Exceptions.ArgumentException:
When setting this property: name is an empty string or contains only whitespace.
-or-
When setting this property: name cannot include prohibited characters.
-or-
When setting this property: The given value for name is already in use as a building type name.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
When setting this property: A non-optional argument was NULL
Since:
2018

Autodesk.Revit.DB.Analysis.HVACLoadBuildingType
The type element of building.
Since:
2018